app/controllers/students_controller.rb

INSERT INTO "students" ("fName", "lName", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fName", "Sally"], ["lName", "McEwen"], ["created_at", "2018-11-10 23:10:04.611876"], ["updated_at", "2018-11-10 23:10:04.611876"]]
---
	def create
		@student = Student.new(student_params)

		if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "lName" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["lName", "McDew"], ["updated_at", "2018-11-10 23:10:16.359746"], ["id", 1]]
---
	def update
		@student = Student.find(params[:id])
		if @student.update(student_params)